cask_args appdir: "/Applications"

tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"

# font needed for powerlevel10k shell theme
cask "font-meslo-lg-nerd-font"

brew "mas"

# Use most recent version of vim
brew "vim"

brew "tmux"
brew "reattach-to-user-namespace"

brew "romkatv/powerlevel10k/powerlevel10k"

# source control systems
brew "git"
brew "git-extras"
brew "git-lfs"

# youtube-dl and dependencies for post processing
brew "yt-dlp/taps/yt-dlp"
brew "ffmpeg"

# utilities
brew "asdf"
brew "bat"
brew "coreutils"
brew "direnv"
brew "fzf"
brew "gpg"
brew "packer"
brew "prettier"
brew "pwgen"
brew "ripgrep"
brew "ssh-copy-id"
brew "urlview"
brew "wget"
brew "wifi-password"
brew "z"
brew "zsh"

# JavasScript related stuff
brew "volta"

brew "gifify"
brew "svgo"

# developing
cask "alacritty"
cask "docker"
cask "iterm2"

# browsers
cask "firefox"
cask "google-chrome"
cask "google-chrome-canary"

# utilities
cask "cold-turkey-blocker"
cask "monitorcontrol"
cask "signal"
cask "slack"
cask "transmission"
cask "twist"

# other
cask "spotify"
cask "vlc"

# screen saver
cask "aerial"

# Apps
mas "1Password", id: 1333542190
mas "Fantastical 2", id: 975937182
mas "Gifski", id: 1351639930
mas "Harvest", id: 506189836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "Todoist", id: 585829637
