# Use most recent version of vim
brew "vim"

brew "tmux"

# source control systems
brew "git"
brew "git-extras"
brew "hub"
brew "mercurial"
brew "subversion"

# youtube-dl and dependencies for post processing
brew "youtube-dl"
brew "ffmpeg"

# utilities
brew "packer"
brew "pwgen"
brew "ssh-copy-id"
brew "urlview"
brew "wget"
brew "wifi-password"
brew "z"

# JavasScript related stuff
brew "nvm"
brew "node"
brew "yarn"

# Erlang and Friends
brew "erlang"
brew "elixir"

# databases
brew "couchdb"
brew "mysql"
brew "postgresql"
brew "redis"

brew "gifify"
brew "svgo"

brew "mas"
