cask_args appdir: "/Applications"

tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"

# font needed for powerlevel10k shell theme
cask "font-meslolg-nerd-font"

brew "mas"

# Use most recent version of vim
brew "vim"

brew "tmux"
brew "reattach-to-user-namespace"

brew "romkatv/powerlevel10k/powerlevel10k"

# source control systems
brew "git"
brew "git-extras"
brew "git-lfs"
brew "mercurial"
brew "subversion"

# youtube-dl and dependencies for post processing
brew "youtube-dl"
brew "ffmpeg"

# utilities
brew "asdf"
brew "coreutils"
brew "fzf"
brew "gpg"
brew "packer"
brew "prettier"
brew "pwgen"
brew "ripgrep"
brew "ssh-copy-id"
brew "urlview"
brew "wget"
brew "wifi-password"
brew "z"
brew "zsh"

# JavasScript related stuff
brew "node"
brew "yarn"

# Erlang and Friends
brew "erlang"
brew "elixir"

# Java
cask "adoptopenjdk"

# databases
brew "couchdb"
brew "mysql"
brew "postgresql"
cask "postgres"
brew "redis"
cask "dbeaver-community"

brew "gifify"
brew "svgo"

# developing
cask "atom"
cask "docker"
cask "iterm2"
cask "vlc"

# browsers
cask "firefox"
cask "google-chrome"
cask "google-chrome-canary"
cask "opera"

# utilities
cask "cyberduck"
cask "flux"
cask "qlmarkdown"
cask "signal"
cask "slack"
cask "transmission"
cask "twist"

# other
cask "spotify"

# screen saver
cask "aerial"

# Apps
mas "1Password", id: 1333542190
mas "Fantastical 2", id: 975937182
mas "Gifski", id: 1351639930
mas "Harvest", id: 506189836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Shush - Microphone Manager", id: 496437906
mas "Telegram", id: 747648890
mas "Todoist", id: 585829637
